/*global jQuery:false, $:false, window:false */

$.ln.validator = {
    unknow: '未知错误',
    wrong:'不合法',
    require: '不能为空',
    currency: '必须是货币类型，两位小数',
    than0cur: '必须是大于0的货币类型',
    number: '必须是非负整数',
    integer: '必须是整数',
    double: '必须是实数',
    english: '必须是英文',
    chinese: '必须是中文',
    unsafe: '包括不安全字符',
    than0num: '必须是大于零整数',
    than0double: '必须大于零',
    limit: ['已填写{0}个字，至少要{1}个字', '已填写{0}个字，最多{2}个字','已填写{0}个字，必须在[{1}, {2}]个字之间'],
    limitb: ['一个汉字两字节，已填写{0}个字节，至少要{1}个字节', '一个汉字两字节，已填写{0}个字节，最多{2}个字节','一个汉字两字节，已填写{0}个字节，必须在[{1}, {2}]个字节之间'],
    group: ['已选择{0}项，至少要选择{1}项', '已选择{0}项，最多选择{2}项','已选择{0}项，必须选择[{1}, {2}]项'],
    range: ['不能小于{1}', '不能大于{2}','必须在[{1}, {2}]范围', '必须是数字'],
    date: ['不合法', '过小，必须在[{1}, {2}]范围', '过大，必须在[{1}, {2}]范围'],
    repeat: '两次填写不一致'
};